## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| recreate | `module.feedback_cronjob.aws_ecs_task_definition.this` |
| add      | `aws_security_group_rule.database_ingress_ecs`         |
| delete   | `aws_network_acl_rule.ecs_egress_mongodb_port`         |
| update   | `module.feedback_cronjob.aws_ecs_service.this`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_network_acl_rule.ecs_egress_mongodb_port will be destroyed
  # (because aws_network_acl_rule.ecs_egress_mongodb_port is not in configuration)
  - resource "aws_network_acl_rule" "ecs_egress_mongodb_port" {
      - cidr_block      = "0.0.0.0/0" -> null
      - egress          = true -> null
      - from_port       = 10255 -> null
      - id              = "nacl-1618560882" -> null
      - network_acl_id  = "acl-0d283394117fa789e" -> null
      - protocol        = "6" -> null
      - rule_action     = "allow" -> null
      - rule_number     = 100 -> null
      - to_port         = 10255 -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow DocumentDB cluster to receive requests from ECS"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d1a911fad1c21348"
      + to_port                  = 27017
      + type                     = "ingress"
        # (1 unchanged attribute hidden)
    }

  # module.feedback_cronjob.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "feedback-cronjob-task"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.feedback_cronjob.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:992382783569:service/feedback-cronjob-cluster/feedback-cronjob-task-service"
        name                               = "feedback-cronjob-task-service"
        tags                               = {
            "CostCentre" = "feedback-cronjob-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task:1" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.feedback_cronjob.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "feedback-cronjob"
                  - portMappings           = []
                  ~ secrets                = [
                        # (5 unchanged elements hidden)
                        {
                            name      = "IRCC_AIRTABLE_BASE"
                            valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/ircc-airtable-base"
                        },
                      ~ {
                            name      = "SPRING_DATA_MONGODB_URI"
                          ~ valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/mongodb-uri" -> ""
                        },
                        {
                            name      = "TRAVEL_AIRTABLE_BASE"
                            valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/travel-airtable-base"
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "feedback-cronjob-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "feedback-cronjob-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ task_definition_arn         = "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task:1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.feedback_cronjob"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
